name: "CaffeNet"

input: "target"
input: "candidate"
input: "rois"
input: "label"

#target
input_dim: 1
input_dim: 3
input_dim: 227
input_dim: 227

#candidate, full image, size W, H to be changed on the fly
input_dim: 1
input_dim: 3
input_dim: 227
input_dim: 227

#rois, hard-coded 250 bboxes score
input_dim: 250
input_dim: 5
input_dim: 1
input_dim: 1

#label, hard-coded 250 bboxes score
input_dim: 1
input_dim: 250
input_dim: 1
input_dim: 1

layer {
  name: "conv1"
  type: "Convolution"
  bottom: "target"
  top: "conv1"
  param {
  	name: "conv1_w"
    lr_mult: 0
    decay_mult: 1
  }
  param {
  	name: "conv1_b"
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 11
    stride: 4
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm1"
  type: "LRN"
  bottom: "pool1"
  top: "norm1"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "norm1"
  top: "conv2"
  param {
  	name: "conv2_w"
    lr_mult: 0
    decay_mult: 1
  }
  param {
  	name: "conv2_b"
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm2"
  type: "LRN"
  bottom: "pool2"
  top: "norm2"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "norm2"
  top: "conv3"
  param {
  	name: "conv3_w"
    lr_mult: 0
    decay_mult: 1
  }
  param {
  	name: "conv3_b"
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
layer {
  name: "conv4"
  type: "Convolution"
  bottom: "conv3"
  top: "conv4"
  param {
  	name: "conv4_w"
    lr_mult: 0
    decay_mult: 1
  }
  param {
  	name: "conv4_b"
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu4"
  type: "ReLU"
  bottom: "conv4"
  top: "conv4"
}
layer {
  name: "conv5"
  type: "Convolution"
  bottom: "conv4"
  top: "conv5"
  param {
  	name: "conv5_w"
    lr_mult: 0
    decay_mult: 1
  }
  param {
  	name: "conv5_b"
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu5"
  type: "ReLU"
  bottom: "conv5"
  top: "conv5"
}
layer {
  name: "pool5"
  type: "Pooling"
  bottom: "conv5"
  top: "pool5"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}


layer {
  name: "conv1_c"
  type: "Convolution"
  bottom: "candidate"
  top: "conv1_c"
  param {
  	name: "conv1_w"
    lr_mult: 0
    decay_mult: 1
  }
  param {
  	name: "conv1_b"
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 11
    stride: 4
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1_c"
  type: "ReLU"
  bottom: "conv1_c"
  top: "conv1_c"
}
layer {
  name: "pool1_c"
  type: "Pooling"
  bottom: "conv1_c"
  top: "pool1_c"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm1_c"
  type: "LRN"
  bottom: "pool1_c"
  top: "norm1_c"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv2_c"
  type: "Convolution"
  bottom: "norm1_c"
  top: "conv2_c"
  param {
  	name: "conv2_w"
    lr_mult: 0
    decay_mult: 1
  }
  param {
  	name: "conv2_b"
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu2_c"
  type: "ReLU"
  bottom: "conv2_c"
  top: "conv2_c"
}
layer {
  name: "pool2_c"
  type: "Pooling"
  bottom: "conv2_c"
  top: "pool2_c"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm2_c"
  type: "LRN"
  bottom: "pool2_c"
  top: "norm2_c"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv3_c"
  type: "Convolution"
  bottom: "norm2_c"
  top: "conv3_c"
  param {
  	name: "conv3_w"
    lr_mult: 0
    decay_mult: 1
  }
  param {
  	name: "conv3_b"
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_c"
  type: "ReLU"
  bottom: "conv3_c"
  top: "conv3_c"
}
layer {
  name: "conv4_c"
  type: "Convolution"
  bottom: "conv3_c"
  top: "conv4_c"
  param {
  	name: "conv4_w"
    lr_mult: 0
    decay_mult: 1
  }
  param {
  	name: "conv4_b"
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu4_c"
  type: "ReLU"
  bottom: "conv4_c"
  top: "conv4_c"
}
layer {
  name: "conv5_c"
  type: "Convolution"
  bottom: "conv4_c"
  top: "conv5_c"
  param {
  	name: "conv5_w"
    lr_mult: 0
    decay_mult: 1
  }
  param {
  	name: "conv5_b"
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu5_c"
  type: "ReLU"
  bottom: "conv5_c"
  top: "conv5_c"
}
layer {
  name: "roi_pool5_c"
  type: "ROIPooling"
  bottom: "conv5_c"
  bottom: "rois"
  top: "pool5_c"
  roi_pooling_param {
    pooled_w: 6
    pooled_h: 6
    spatial_scale: 0.0625 # 1/16
  }
}

layer {
  name: "reshape_roi_pool5_c"
  type: "Reshape"
  bottom: "pool5_c"
  top: "pool5_c"
  reshape_param {
    shape {
      dim: 1
      dim: -1
      dim: 0
      dim: 0
    }
  }
}

layer {
  name: "concat"
  type: "Concat"
  bottom: "pool5"
  bottom: "pool5_c"
  top: "pool5_concat"
  concat_param {
    axis: 1
  }
}

layer {
  name: "fc6-gmd"
  type: "InnerProduct"
  bottom: "pool5_concat"
  top: "fc6"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu6"
  type: "ReLU"
  bottom: "fc6"
  top: "fc6"
}
layer {
  name: "drop6"
  type: "Dropout"
  bottom: "fc6"
  top: "fc6"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc7-gmd"
  type: "InnerProduct"
  bottom: "fc6"
  top: "fc7"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu7"
  type: "ReLU"
  bottom: "fc7"
  top: "fc7"
}
layer {
  name: "drop7"
  type: "Dropout"
  bottom: "fc7"
  top: "fc7"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc7-gmd-b"
  type: "InnerProduct"
  bottom: "fc7"
  top: "fc7b"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu7b"
  type: "ReLU"
  bottom: "fc7b"
  top: "fc7b"
}
layer {
  name: "drop7b"
  type: "Dropout"
  bottom: "fc7b"
  top: "fc7b"
  dropout_param {
    dropout_ratio: 0.5
  }
}

# flatten label
layer {
  name: "flatten"
  type: "Flatten"
  bottom: "label"
  top: "label_flat"
}

# k domains
layer {
  name: "fc8_k0"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k0"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k0"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k0"
  bottom: "label_flat"
  top: "loss_k0"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k1"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k1"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k1"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k1"
  bottom: "label_flat"
  top: "loss_k1"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k2"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k2"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k2"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k2"
  bottom: "label_flat"
  top: "loss_k2"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k3"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k3"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k3"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k3"
  bottom: "label_flat"
  top: "loss_k3"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k4"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k4"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k4"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k4"
  bottom: "label_flat"
  top: "loss_k4"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k5"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k5"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k5"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k5"
  bottom: "label_flat"
  top: "loss_k5"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k6"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k6"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k6"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k6"
  bottom: "label_flat"
  top: "loss_k6"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k7"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k7"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k7"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k7"
  bottom: "label_flat"
  top: "loss_k7"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k8"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k8"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k8"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k8"
  bottom: "label_flat"
  top: "loss_k8"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k9"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k9"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k9"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k9"
  bottom: "label_flat"
  top: "loss_k9"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k10"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k10"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k10"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k10"
  bottom: "label_flat"
  top: "loss_k10"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k11"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k11"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k11"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k11"
  bottom: "label_flat"
  top: "loss_k11"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k12"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k12"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k12"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k12"
  bottom: "label_flat"
  top: "loss_k12"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k13"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k13"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k13"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k13"
  bottom: "label_flat"
  top: "loss_k13"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k14"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k14"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k14"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k14"
  bottom: "label_flat"
  top: "loss_k14"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k15"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k15"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k15"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k15"
  bottom: "label_flat"
  top: "loss_k15"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k16"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k16"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k16"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k16"
  bottom: "label_flat"
  top: "loss_k16"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k17"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k17"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k17"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k17"
  bottom: "label_flat"
  top: "loss_k17"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k18"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k18"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k18"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k18"
  bottom: "label_flat"
  top: "loss_k18"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k19"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k19"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k19"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k19"
  bottom: "label_flat"
  top: "loss_k19"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k20"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k20"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k20"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k20"
  bottom: "label_flat"
  top: "loss_k20"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k21"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k21"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k21"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k21"
  bottom: "label_flat"
  top: "loss_k21"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k22"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k22"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k22"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k22"
  bottom: "label_flat"
  top: "loss_k22"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k23"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k23"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k23"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k23"
  bottom: "label_flat"
  top: "loss_k23"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k24"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k24"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k24"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k24"
  bottom: "label_flat"
  top: "loss_k24"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k25"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k25"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k25"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k25"
  bottom: "label_flat"
  top: "loss_k25"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k26"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k26"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k26"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k26"
  bottom: "label_flat"
  top: "loss_k26"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k27"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k27"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k27"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k27"
  bottom: "label_flat"
  top: "loss_k27"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k28"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k28"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k28"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k28"
  bottom: "label_flat"
  top: "loss_k28"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k29"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k29"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k29"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k29"
  bottom: "label_flat"
  top: "loss_k29"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k30"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k30"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k30"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k30"
  bottom: "label_flat"
  top: "loss_k30"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k31"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k31"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k31"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k31"
  bottom: "label_flat"
  top: "loss_k31"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k32"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k32"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k32"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k32"
  bottom: "label_flat"
  top: "loss_k32"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k33"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k33"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k33"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k33"
  bottom: "label_flat"
  top: "loss_k33"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k34"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k34"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k34"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k34"
  bottom: "label_flat"
  top: "loss_k34"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k35"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k35"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k35"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k35"
  bottom: "label_flat"
  top: "loss_k35"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k36"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k36"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k36"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k36"
  bottom: "label_flat"
  top: "loss_k36"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k37"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k37"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k37"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k37"
  bottom: "label_flat"
  top: "loss_k37"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k38"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k38"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k38"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k38"
  bottom: "label_flat"
  top: "loss_k38"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k39"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k39"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k39"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k39"
  bottom: "label_flat"
  top: "loss_k39"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k40"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k40"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k40"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k40"
  bottom: "label_flat"
  top: "loss_k40"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k41"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k41"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k41"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k41"
  bottom: "label_flat"
  top: "loss_k41"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k42"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k42"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k42"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k42"
  bottom: "label_flat"
  top: "loss_k42"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k43"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k43"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k43"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k43"
  bottom: "label_flat"
  top: "loss_k43"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k44"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k44"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k44"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k44"
  bottom: "label_flat"
  top: "loss_k44"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k45"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k45"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k45"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k45"
  bottom: "label_flat"
  top: "loss_k45"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k46"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k46"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k46"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k46"
  bottom: "label_flat"
  top: "loss_k46"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k47"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k47"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k47"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k47"
  bottom: "label_flat"
  top: "loss_k47"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k48"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k48"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k48"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k48"
  bottom: "label_flat"
  top: "loss_k48"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k49"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k49"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k49"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k49"
  bottom: "label_flat"
  top: "loss_k49"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k50"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k50"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k50"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k50"
  bottom: "label_flat"
  top: "loss_k50"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k51"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k51"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k51"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k51"
  bottom: "label_flat"
  top: "loss_k51"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k52"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k52"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k52"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k52"
  bottom: "label_flat"
  top: "loss_k52"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k53"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k53"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k53"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k53"
  bottom: "label_flat"
  top: "loss_k53"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k54"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k54"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k54"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k54"
  bottom: "label_flat"
  top: "loss_k54"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k55"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k55"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k55"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k55"
  bottom: "label_flat"
  top: "loss_k55"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k56"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k56"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k56"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k56"
  bottom: "label_flat"
  top: "loss_k56"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k57"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k57"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k57"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k57"
  bottom: "label_flat"
  top: "loss_k57"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k58"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k58"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k58"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k58"
  bottom: "label_flat"
  top: "loss_k58"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k59"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k59"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k59"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k59"
  bottom: "label_flat"
  top: "loss_k59"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k60"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k60"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k60"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k60"
  bottom: "label_flat"
  top: "loss_k60"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k61"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k61"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k61"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k61"
  bottom: "label_flat"
  top: "loss_k61"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k62"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k62"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k62"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k62"
  bottom: "label_flat"
  top: "loss_k62"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k63"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k63"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k63"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k63"
  bottom: "label_flat"
  top: "loss_k63"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k64"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k64"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k64"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k64"
  bottom: "label_flat"
  top: "loss_k64"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k65"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k65"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k65"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k65"
  bottom: "label_flat"
  top: "loss_k65"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k66"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k66"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k66"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k66"
  bottom: "label_flat"
  top: "loss_k66"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k67"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k67"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k67"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k67"
  bottom: "label_flat"
  top: "loss_k67"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k68"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k68"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k68"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k68"
  bottom: "label_flat"
  top: "loss_k68"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k69"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k69"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k69"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k69"
  bottom: "label_flat"
  top: "loss_k69"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k70"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k70"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k70"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k70"
  bottom: "label_flat"
  top: "loss_k70"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k71"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k71"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k71"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k71"
  bottom: "label_flat"
  top: "loss_k71"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k72"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k72"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k72"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k72"
  bottom: "label_flat"
  top: "loss_k72"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k73"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k73"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k73"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k73"
  bottom: "label_flat"
  top: "loss_k73"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k74"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k74"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k74"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k74"
  bottom: "label_flat"
  top: "loss_k74"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k75"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k75"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k75"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k75"
  bottom: "label_flat"
  top: "loss_k75"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k76"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k76"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k76"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k76"
  bottom: "label_flat"
  top: "loss_k76"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k77"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k77"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k77"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k77"
  bottom: "label_flat"
  top: "loss_k77"
  include { phase: TRAIN }
}
layer {
  name: "fc8_k78"  
  type: "InnerProduct"  
  bottom: "fc7b"  
  top: "fc8_k78"  
  param {
    lr_mult: 10 
    decay_mult: 1 
  }
  param {
    lr_mult: 20 
    decay_mult: 0 
  }
  inner_product_param {
    num_output: 250
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_k78"
  type: "SigmoidCrossEntropyLoss"
  bottom: "fc8_k78"
